docs/docs.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-02-02 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Documentation</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Cem Keylan">
<link rel="stylesheet" type="text/css" href="/style.css">
</head>
<body>
<div id="preamble" class="status">
<nav id="navbar">
    <a href="/" class=navbartitle>Carbs Linux</a>

    <label for="hamburger">&#9776;</label>
    <input type="checkbox" id="hamburger" />
    <ul id=navbarlist>
        <li><a href="/" title="Home Page">Home</a></li>
        <li><a href="//git.carbslinux.org" title="Git Repository">Git</a></li>
        <li><a href="/download.html" title="Download Carbs Linux">Download</a></li>
        <li><a href="/blog" title="Blog Posts">Blog</a></li>
        <li><a href="/install.html" title="Installation Instructions">Installation</a></li>
        <li><a href="/docs.html" title="Documentation">Docs</a></li>
    </ul>
</nav>
</div>
<div id="content">
<header>
<h1 class="title">Documentation</h1>
</header><p>
Below are sources of documentation regarding Carbs Linux and tools surrounding
it.
</p>

<div id="outline-container-orgdf416ed" class="outline-2">
<h2 id="orgdf416ed">User Manual</h2>
<div class="outline-text-2" id="text-orgdf416ed">
<p>
Carbs Linux User Manual aims to be a general-purpose explanation of the
distribution, from the installation steps to the style guide of the project. It
can be accessed or otherwise obtained with various methods:
</p>
</div>

<div id="outline-container-org22e859c" class="outline-3">
<h3 id="org22e859c">HTML</h3>
<div class="outline-text-3" id="text-org22e859c">
<p>
You can view the Manual from your browser. The Manual can be viewed as
</p>

<ul class="org-ul">
<li><a href="docs/carbslinux">One HTML page per node</a></li>
<li><a href="docs/carbslinux.html">Single HTML page</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb47e655" class="outline-3">
<h3 id="orgb47e655">Plain text</h3>
<div class="outline-text-3" id="text-orgb47e655">
<p>
You can download <a href="docs/carbslinux.txt">carbslinux.txt</a> in order to view the Manual from your preferred
pager.
</p>

<div class="org-src-container">
<pre class="src src-sh">curl -LO https://carbslinux.org/docs/carbslinux.txt
less carbslinux.txt
</pre>
</div>
</div>
</div>

<div id="outline-container-org372faa1" class="outline-3">
<h3 id="org372faa1">Info</h3>
<div class="outline-text-3" id="text-org372faa1">
<p>
You can install the <code>carbs-docs</code> package and either <code>texinfo</code> or <code>info</code> packages
to view the Manual offline.
</p>

<div class="org-src-container">
<pre class="src src-sh">cpt bi info carbs-docs
info carbslinux
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf2eddf6" class="outline-3">
<h3 id="orgf2eddf6">Source</h3>
<div class="outline-text-3" id="text-orgf2eddf6">
<p>
You can also acquire the source for generating the Manual, which requires
<code>emacs</code> for exporting the Org-mode documentation and <code>texinfo</code> for generating
html/info pages.
</p>

<div class="org-src-container">
<pre class="src src-sh">git clone git://git.carbslinux.org/docs
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org818b50e" class="outline-2">
<h2 id="org818b50e">Installation Instructions</h2>
<div class="outline-text-2" id="text-org818b50e">
<p>
Installation Manual is part of the <a href="#orgdf416ed">User Manual</a>, but it can also be obtained
separately:
</p>

<ul class="org-ul">
<li><a href="install.html">HTML</a></li>
<li><a href="install.txt">Plaintext</a></li>
</ul>
</div>
</div>

<div id="outline-container-org8a6251e" class="outline-2">
<h2 id="org8a6251e">Carbs Packaging Tools</h2>
<div class="outline-text-2" id="text-org8a6251e">
<p>
The user manual for CPT is not complete yet, but will be released with the 6.0.0
release. You can see the <a href="https://github.com/CarbsLinux/cpt">repository</a> in order to check its status.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer>
    <p>Linux&reg; is a registered trademark of Linus Torvalds</p>
    <p>Copyright &copy; 2019-2021 Cem Keylan</p>
</footer>
</div>
</body>
</html>
